# 155. Уникальные элементы


## Описание
Задан массив aa размера nn. Необходимо посчитать количество уникальных элементов в данном массиве. Элемент называется уникальным, если встречается **в массиве** ровно один раз.

#### Формат ввода
В первой строке входных данных подается одно целое число n (1≤n≤10^5).

Во второй строке входных данных подается nn целых чисел, разделенных пробелами - a1, a2, ......, an (1≤ai≤10^9).

#### Формат вывода
В единственной строке выведите ответ на задачу.

#### Ограничения
- Ограничение времени 2 с
- Ограничение памяти 128 МБ

#### Пример 1
```
Ввод
5
1 2 3 4 5

Вывод
5
```

#### Пример 2:
```
Ввод
5
1 2 3 4 4

Вывод
3
```

#### Пример 3:
```
Ввод
10
9 3 10 5 7 6 4 1 2 8

Вывод
10
```


## Решение

### Python3
```python
import sys
from collections import Counter


def main():
    """
    Для чтения входных данных необходимо получить их
    из стандартного потока ввода (sys.stdin).
    Данные во входном потоке соответствуют описанному
    в условии формату. Обычно входные данные состоят
    из нескольких строк.
    Можно использовать несколько методов:
    * input() -- читает одну строку из потока без символа
    перевода строки;
    * sys.stdin.readline() -- читает одну строку из потока,
    сохраняя символ перевода строки в конце;
    * sys.stdin.readlines() -- вернет список (list) строк,
    сохраняя символ перевода строки в конце каждой из них.
    Чтобы прочитать из строки стандартного потока:
    * число -- int(input()) # в строке должно быть одно число
    * строку -- input()
    * массив чисел -- map(int, input().split())
    * последовательность слов -- input().split()
    Чтобы вывести результат в стандартный поток вывода (sys.stdout),
    можно использовать функцию print() или sys.stdout.write().
    Возможное решение задачи "Вычислите сумму чисел в строке":
    print(sum(map(int, input().split())))
    """
    input()
    res = 0
    for v, cnt in dict(Counter(input().split())).items():
        if cnt == 1:
            res += 1
    print(res)


if __name__ == '__main__':
    main()
```
