# 349. Опять JSON’ы перекладывать (разминка)


## Описание
Всем хотя бы раз в жизни приходилось перекладывать JSON. Вот и для нового проекта под названием `Единое хранилище` необходимо переложить магазинные фиды. Для размещения на Яндекс Маркете магазины передают товары из своего ассортимент в JSON-файлах. Одно товарное предложение описывается так: 

```
{
    "offer_id": <string>,
    "market_sku": <int>,
    "price": <int>
}
```

где `offer_id` --- уникальный среди всех фидов магазина идентификатор предложения, `market_sku` --- идентификатор товара на Яндекс Маркете, `price` --- стоимость товара.

Весь фид магазина представляет собой JSON и выглядит так:

```
{
    "offers": [<offer>, <offer>, ...]
}
```

Вас попросили написать программу, которая объединит все фиды одного магазина в единый фид. Так как фид может получиться достаточно большим, требуется оставить только m первых в порядке следования во входных данных товарных предложений.

#### Формат ввода
На первой строке входных данных содержатся целые числа nn и mm --- количество фидов магазина и максимальное количество товарных предложений в итоговом фиде (1≤n≤200,1≤m≤4⋅10^4).

Следующие nn строк содержат по одному магазинному фиду на строку. В одном фиде не больше 200 товарных предложений. 

Гарантируется, что строка --- валидный JSON и удовлетворяет формату фида. `offer_id` состоит из строчных и заглавных букв латинского алфавита и цифр, 1≤∣offer_id∣≤10, 1≤market_sku≤2^31-1, 1≤price≤10^6.

#### Формат вывода
Выходной поток должен содержать один JSON-документ, удовлетворяющий формату товарного фида. Порядок товарных предложений, количество строк в документе и табуляция не имеют значения.

#### Ограничения
- Ограничение времени 2 с
- Ограничение памяти 256 МБ

#### Пример 1:
```
Ввод
2 3
{"offers": [{"offer_id": "offer1", "market_sku": 10846332, "price": 1490}, {"offer_id": "offer2", "market_sku": 682644, "price": 499}]}
{"offers": [{"offer_id": "offer3", "market_sku": 832784, "price": 14000}, {"offer_id": "offer4", "market_sku": 3234, "price": 100}]}

Вывод
{"offers":[{"market_sku":10846332,"offer_id":"offer1","price":1490},{"market_sku":682644,"offer_id":"offer2","price":499},{"market_sku":832784,"offer_id":"offer3","price":14000}]}
```


## Решение

### Python3
```python
import sys
import json


def main():
    """
    Для чтения входных данных необходимо получить их
    из стандартного потока ввода (sys.stdin).
    Данные во входном потоке соответствуют описанному
    в условии формату. Обычно входные данные состоят
    из нескольких строк.
    Можно использовать несколько методов:
    * input() -- читает одну строку из потока без символа
    перевода строки;
    * sys.stdin.readline() -- читает одну строку из потока,
    сохраняя символ перевода строки в конце;
    * sys.stdin.readlines() -- вернет список (list) строк,
    сохраняя символ перевода строки в конце каждой из них.
    Чтобы прочитать из строки стандартного потока:
    * число -- int(input()) # в строке должно быть одно число
    * строку -- input()
    * массив чисел -- map(int, input().split())
    * последовательность слов -- input().split()
    Чтобы вывести результат в стандартный поток вывода (sys.stdout),
    можно использовать функцию print() или sys.stdout.write().
    Возможное решение задачи "Вычислите сумму чисел в строке":
    print(sum(map(int, input().split())))
    """
    n, m = map(int, input().split())
    que = []
    for _ in range(int(n)):
        que += json.loads(input())["offers"]

    print("{" + f'"offers":{que[:m]}'.replace(" ", "").replace("'", '"') + "}")
    


if __name__ == '__main__':
    main()
```
